Config/Catalogs/НастройкаФорматовОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкаФорматовОбменаБанкиКС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТипыОбменаБанкиКС</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/СписокФорматовНастройкиОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СписокФорматовНастройкиОбменаБанкиКС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаФормата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/НаправлениеОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НаправлениеОбменаБанкиКС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Экспорт</Name>
					<Comment>Выгрузка из системы в казначейсткие и банковские системы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
					<Comment>Загрузка из казначейских и банковских систем</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ФорматыОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФорматыОбменаБанкиКС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТипыОбменаБанкиКС</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииАльбома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВОдномФайле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъектаВНастройке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаФорматирования</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеИспользованияФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВОтдельномФайле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортПроведенныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаКонвертация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевыеПоляОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГруппировкиФорматов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСлужебногоКонверта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолеФайлаПередачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоляФайлаПередачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДанныхОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничениеРазмерности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПоляФайлаПередачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокЗаполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательностьЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаВалидностиДанных</Name>
							<Comment>Позволяет проверить выгружаемое значение на корректность</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СообщениеПриОшибкеВалидности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СекцияПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеременнаяПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСекции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Многострочная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаПолейФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеПримененияПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заголовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/НастройкаФорматовОбменаБанкиКС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПрочитатьСписокФорматовНастройки(ОбъектОтбора, ТипФормата, СписокФорматовНастройки) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектОтбора", 	ОбъектОтбора);
	Запрос.УстановитьПараметр("ТипФормата", 	ТипФормата);

	Запрос.Текст = "ВЫБРАТЬ
				   |	"""" КАК ОбъектИмя,
	               |	ВложенныйЗапрос.ПредставлениеОбъекта,
				   |	"""" КАК ОбъектТип,
				   |	ВложенныйЗапрос.Идентификатор,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЗначениеФормата) КАК Формат,
	               |	МАКСИМУМ(ВложенныйЗапрос.ОписаниеФормата) КАК ОписаниеФормата
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
				   //|		ФорматОбмена.ОбъектИмя КАК ОбъектИмя,
	               |		ФорматОбмена.ПредставлениеОбъектаВНастройке КАК ПредставлениеОбъекта,
				   //|		ФорматОбмена.ОбъектТип КАК ОбъектТип,
				   |		ФорматОбмена.Идентификатор Как Идентификатор,
	               |		NULL КАК ЗначениеФормата,
	               |		NULL КАК ОписаниеФормата
	               |	ИЗ
	               |		Справочник.ФорматыОбменаБанкиКС КАК ФорматОбмена,
	               |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
				   //|			ФорматОбмена.ОбъектИмя КАК ОбъектИмя,
	               |			ФорматОбмена.ПредставлениеОбъектаВНастройке КАК ПредставлениеОбъекта,
				   //|			ФорматОбмена.ОбъектТип КАК ОбъектТип,
				   |			ФорматОбмена.Идентификатор Как Идентификатор,
	               |			NULL КАК ЗначениеФормата,
	               |			NULL КАК ОписаниеФормата
	               |		ИЗ
	               |			Справочник.ФорматыОбменаБанкиКС КАК ФорматОбмена
	               |		ГДЕ
	               |			ФорматОбмена.Владелец = &ТипФормата
				   |			И ФорматОбмена.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.НаправлениеОбменаБанкиКС.Экспорт)
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
				   //|			СписокФорматовНастройкиОбменаБанкиКС.ОбъектИмя,
	               |			СписокФорматовНастройкиОбменаБанкиКС.ПредставлениеОбъекта,
				   //|			СписокФорматовНастройкиОбменаБанкиКС.ОбъектТип,
				   |			СписокФорматовНастройкиОбменаБанкиКС.Идентификатор,
	               |			СписокФорматовНастройкиОбменаБанкиКС.Формат,
	               |			СписокФорматовНастройкиОбменаБанкиКС.Формат.КраткоеНаименование
	               |		ИЗ
	               |			РегистрСведений.СписокФорматовНастройкиОбменаБанкиКС КАК СписокФорматовНастройкиОбменаБанкиКС
	               |		ГДЕ
	               |			СписокФорматовНастройкиОбменаБанкиКС.НастройкаФормата = &ОбъектОтбора) КАК ВложенныйЗапрос
	               |	ГДЕ
	               |		ФорматОбмена.Владелец = &ТипФормата 
				   |		И ФорматОбмена.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.НаправлениеОбменаБанкиКС.Экспорт)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
				   //|		СписокФорматовНастройкиОбменаБанкиКС.ОбъектИмя,
	               |		СписокФорматовНастройкиОбменаБанкиКС.ПредставлениеОбъекта,
				   //|		СписокФорматовНастройкиОбменаБанкиКС.ОбъектТип,
				   |		СписокФорматовНастройкиОбменаБанкиКС.Идентификатор,
	               |		СписокФорматовНастройкиОбменаБанкиКС.Формат,
	               |		СписокФорматовНастройкиОбменаБанкиКС.Формат.КраткоеНаименование
	               |	ИЗ
	               |		РегистрСведений.СписокФорматовНастройкиОбменаБанкиКС КАК СписокФорматовНастройкиОбменаБанкиКС
	               |	ГДЕ
	               |		СписокФорматовНастройкиОбменаБанкиКС.НастройкаФормата = &ОбъектОтбора) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               //|	ВложенныйЗапрос.ОбъектТип,
				   |	ВложенныйЗапрос.Идентификатор,
	               |	ВложенныйЗапрос.ПредставлениеОбъекта";
	               //|	,ВложенныйЗапрос.ОбъектИмя";
				   
	СписокФорматовНастройки = (Запрос.Выполнить().Выгрузить());
   
КонецПроцедуры	

Процедура ЗаписатьСписокФорматов(ТаблицаЗаписей, Ссылка, Отказ) Экспорт
	
	НаборЗаписей = РегистрыСведений.СписокФорматовНастройкиОбменаБанкиКС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаФормата.Установить(Ссылка);
	НаборЗаписей.Загрузить(ТаблицаЗаписей);
	
	Индекс = 0;
	Пока 1 = 1 Цикл
		Если Индекс > НаборЗаписей.Количество() - 1 Тогда
			Прервать;
		КонецЕсли; 
		
		Запись = НаборЗаписей[Индекс];
		
		Если НЕ ЗначениеЗаполнено(Запись.Формат) Тогда
			НаборЗаписей.Удалить(Запись);
			Продолжить;
		КонецЕсли;
		
		Запись.НастройкаФормата = Ссылка;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Элемент %1 не записан. Не записан список используемых форматов.'"),
		СокрЛП(Ссылка));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
		ВызватьИсключение ОписаниеОшибки();
		
		Возврат;
		
	КонецПопытки;
	
	ПрочитатьСписокФорматовНастройки(Ссылка, Ссылка.Владелец, НаборЗаписей);
	
КонецПроцедуры	

Функция ПолучитьСписокДействующихФорматовВыбранногоТипа(ТипФормата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	КС_Форматы.ИдентификаторОбъекта,
				   |	КС_Форматы.ПредставлениеОбъектаВНастройке,
				   |	МАКСИМУМ(КС_Форматы.ДатаДействия) КАК ДатаДействия
				   |ПОМЕСТИТЬ ТипыОбъектов
				   |ИЗ
				   |	Справочник.ФорматыОбменаБанкиКС КАК КС_Форматы
				   |ГДЕ
				   |	КС_Форматы.Владелец            = &Владелец
				   |	И КС_Форматы.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.НаправлениеОбменаБанкиКС.Экспорт)
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	КС_Форматы.ИдентификаторОбъекта,
				   |	КС_Форматы.ПредставлениеОбъектаВНастройке
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	КС_Форматы.Ссылка КАК Формат
				   |ИЗ
				   |	ТипыОбъектов КАК ТипыОбъектов
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФорматыОбменаБанкиКС КАК КС_Форматы
				   |		ПО ТипыОбъектов.ИдентификаторОбъекта              = КС_Форматы.ИдентификаторОбъекта
				   |			И ТипыОбъектов.ПредставлениеОбъектаВНастройке = КС_Форматы.ПредставлениеОбъектаВНастройке
				   |			И ТипыОбъектов.ДатаДействия                   = КС_Форматы.ДатаДействия
				   |			И (КС_Форматы.Владелец                        = &Владелец)
				   |			И (КС_Форматы.НаправлениеОбмена               = ЗНАЧЕНИЕ(Перечисление.НаправлениеОбменаБанкиКС.Экспорт))
				   |";	
	
	Запрос.УстановитьПараметр("Владелец", ТипФормата);
	
	ТЗНастройки           = Запрос.Выполнить().Выгрузить();
	МассивОбъектов        = Новый Массив;
	МассивСтрокНаУдаление = Новый Массив;
	
	Для каждого СтрокаНастройки  из ТЗНастройки Цикл
		
		ОбъектНастройки   = СтрокаНастройки.Формат.ПредставлениеОбъектаВНастройке;
		
		Если  МассивОбъектов.Найти(ОбъектНастройки) = Неопределено Тогда
			МассивОбъектов.Добавить(ОбъектНастройки);
		Иначе
			МассивСтрокНаУдаление.Добавить(СтрокаНастройки);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ЛишняяСтрока из МассивСтрокНаУдаление Цикл
		ТЗНастройки.Удалить(ЛишняяСтрока);
	КонецЦикла;
		
	Возврат ТЗНастройки;
	
КонецФункции	

Функция ПроверитьНаличиеИЗаписатьСписокНастроек(Настройка, СоздаватьНаборПриОтсутствии = Ложь, СоздаватьВсегда = Ложь) Экспорт
	
	ЕстьНастройки = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СписокФорматовНастройкиОбменаБанкиКС.Формат
	|ИЗ
	|	РегистрСведений.СписокФорматовНастройкиОбменаБанкиКС КАК СписокФорматовНастройкиОбменаБанкиКС
	|ГДЕ
	|	СписокФорматовНастройкиОбменаБанкиКС.НастройкаФормата = &Настройка");	
	
	Запрос.УстановитьПараметр("Настройка", Настройка); 
	
	Если Запрос.Выполнить().Пустой() Тогда
		ЕстьНастройки = Ложь;
	КонецЕсли;
	
	Если (НЕ СоздаватьНаборПриОтсутствии ИЛИ ЕстьНастройки) И НЕ СоздаватьВсегда Тогда
		Возврат ЕстьНастройки;
	КонецЕсли;	
	
	СписокФорматов = ПолучитьСписокДействующихФорматовВыбранногоТипа(Настройка.Владелец);
	
	СписокФорматов.Колонки.Добавить("НастройкаФормата");
	СписокФорматов.ЗаполнитьЗначения(Настройка, "НастройкаФормата");
	
	НаборЗаписей = РегистрыСведений.СписокФорматовНастройкиОбменаБанкиКС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаФормата.Установить(Настройка);
	НаборЗаписей.Загрузить(СписокФорматов);

	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Элемент ""%1""  не записан. Не записан список используемых форматов. ""%2""'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Настройка, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции	
	
#КонецОбласти

#КонецЕсли
